[
{"Venus Flytrap Name": "Diablo Rouge (Red Devil)", "Description": "Diablo Rouge, also known as Red Devil, is a Microdent-style Venus flytrap with lots of very small teeth but with all-red leaves and traps.  It's a stunningly beautiful Venus flytrap!                                Learn More"},
{"Venus Flytrap Name": "Red Shark Teeth", "Description": "Red Shark Teeth is one of the darkest red-colored plants in our collection.  It is a full-time low-growing Venus flytrap with short, thick teeth reminiscent of shark teeth, hence the name.  It is a wonderful plant and one of our recently acquired favorites!                                Learn More"},
{"Venus Flytrap Name": "Pinnacle", "Description": "Pinnacle is a giant Venus flytrap variety that produces tall, robust leaves that grow nearly straight up in the summer and are topped with large traps on the ends of the leaves.   Pinnacle also boasts graceful long cilia (\"teeth\").\r\n\r\nPinnacle was grown from seed by long-time Venus flytrap grower Dr. Samuel Vergio Miensinompe.  Sam wrote that the typical trap of a fully grown Pinnacle is about one and three quarters inches.  Sam states that Pinnacle traps can get as large as two inches, and sometimes they can pass the 2 inch mark by a few fractions of an inch when they are fully grown (that's about as big as it gets for Flytraps).                                Learn More"},
{"Venus Flytrap Name": "FTS Archangel", "Description": "FTS Archangel is a deep-red flytrap with an extraordinarily arched \"back,\" and can display varied coloration with shades of yellows, greens and reds.  It boasts uniquely shorter \"teeth\" and grows nicely and neatly upright in the spring and summer, with not too much tall growth.  It can produce traps that are quite large on the shorter than normal leaves, which creates an interesting look.                                Learn More"},
{"Venus Flytrap Name": "DC XL", "Description": "This is it! THE LARGEST TRAPS WE'VE EVER SEEN! Out of the thousands of flytraps we have growing here at FlytrapStore, DC XL grows the largest traps of any flytrap we've ever grown. The first traps in spring are usually the largest and can approach 2 inches in size on a fully grown DC XL flytrap. In addition to being ginormous for a Venus flytrap, DC XL is also an extraordinarily hardy grower, more than any other type we know of. DC XL is a handsome hardy monster flytrap, and we learn to love it more and more as we watch it grow over the seasons.\r\n                                Learn More"},
{"Venus Flytrap Name": "GJ Giant Cudo", "Description": "GJ Giant Cudo has wicked shaped traps and a freaky growth habit making it easy to pick out of any collection and a must have for those who love unusual flytraps!                                Learn More"},
{"Venus Flytrap Name": "Biohazard", "Description": "Biohazard is a \"shockingly\" freaky cultivar that looks like its traps have had electricity run through them, causing them to splay out at odd angles!                                Learn More"},
{"Venus Flytrap Name": "FTS Incredible Red Hulk", "Description": "FTS Incredible Red Hulk is a giant all-red Venus flytrap with a wide green stripe along the edge of its sawtoothed traps.  As the traps age, this green line gets narrower as the red color creeps outward.  FTS Incredible Red Hulk can get very large traps (over 1.5 inches) and extremely long petioles -- on the order of 8+ inches!  It is also very vigorous for a red-leafed flytrap and can retain large traps even into dormancy.  Truly an amazing plant!                                Learn More"},
{"Venus Flytrap Name": "Kayan", "Description": "Kayan has an exceptionally long \"neck\" (petiole) connecting the leaf-base to the trap!  Super cool!!  In most other ways it is a classic-looking flytrap that grows with excellent vigor and is a notably good hunter.                                Learn More"},
{"Venus Flytrap Name": "BCP Kim Jong-Il", "Description": "A creepy little dictator of a plant, BCP Kim Jong-Il is, in our opinion, the best clone in the dictator series offered by Best Carnivorous Plants (BCP). Also known as BCP 1343-02, BCP Kim Jong-Il is a very, very small Venus flytrap variety -- overall maximum size is about 2 inches in diameter -- with unusual trap shape and gnarly little jagged teeth along the edge of its small traps.                                Learn More"},
{"Venus Flytrap Name": "Rehder Giant #1", "Description": "Rehder Giant #1 is one of three wild flytraps Matt was given the opportunity to legally harvest from Stanley Rehder Carnivorous Plant Garden in Wilmington, North Carolina, where flytraps grow natively.                                Learn More"},
{"Venus Flytrap Name": "Deluxe Carnivorous Gift Package", "Description": "Why just send a plant?  Sure, a Venus Flytrap is a great gift, but you can super-impress with this Deluxe Carnivorous Gift Package for the Flytrap-enthusiast.                                Learn More"},
{"Venus Flytrap Name": "Trev's Dracula", "Description": "Not to be confused with Polish Dracula, this Dracula was obtained directly from Trev Cox of Ireland.  This clone originated first and is more highly touted for its blood-red traps and serrated teeth.  \r\n\r\nFlytrapStore is the only carnivorous plant nursery in the United States to have offered a Dracula Venus fly trap obtained directly from Trev Cox.\r\n\r\nNote:  Interestingly, the saw-tooth development for Trev's Dracula is seasonal, showing up most strongly in the Summer.\r\n\r\nPhotos of the plant can be found here: Photos of Dionaea Dracula.  The most famous photo of Trev's Dracula can be seen here:\r\nInfamous photo of Trev's Dracula                                Learn More"},
{"Venus Flytrap Name": "MD Buttcheeks", "Description": "This unusual Venus flytrap produces traps that look very much like buttcheeks, hence the name!\r\n\r\nPhotos here: MD Buttcheeks Venus flytrap Photos                                Learn More"},
{"Venus Flytrap Name": "GJ Phalanx", "Description": "Named for its very long marginal lashes that are usually red in coloration, GJ Phalanx is a very striking Venus flytrap.  If you like GJ Phalanx, be sure to check out another plant from our own breeding program, Trictherfalle x Coquillage, that has very long \"teeth\" which rival or surpass those of Phalanx!\r\n\r\nPhotos of this wonderful flytrap can be found here: Photos of Phalanx Venus flytrap.                                Learn More"},
{"Venus Flytrap Name": "Purple Haze", "Description": "Purple Haze is an offspring of the cross 'Low Giant' and 'Akai Ryu' produced in 2005.  It grows low to the ground year round, can get larger than average, and will stay dark purple in coloration if grown in good light.  It is a genetically somewhat smaller plant than the \"giant\" flytraps.                                Learn More"},
{"Venus Flytrap Name": "SD Kronos", "Description": "SD Kronos is a giant Venus fly trap grown from seed started in 2011 by Stephen Doonan.  Steve describes the plant as: \"The best Venus Flytrap of thousands grown from the Flytrap Ranch's own seed over the years.\"\r\n\r\nIt is truly a giant flytrap, producing traps that are exceptionally large, on average.  For us, the largest trap hasn't yet quite reached the size of the largest DC XL trap we've seen, but the traps are much larger on average throughout the season than most of the giant flytraps.  SD Kronos also has really attractive coloration on its traps.  A beautiful Venus Flytrap indeed.                                Learn More"},
{"Venus Flytrap Name": "B52 x BCP Giant", "Description": "B52 x BCP Giant is a very large-trapped and extremely vigorous cultivar.  B52 x BCP Giant has impressed us with its vigor and size, as well as hardiness.  It ranks up there with some of the classic giants like B52, Low Giant and others.  It has nice neat upright growth, and nice big traps.  A real handsome giant Flytrap.                                Learn More"},
{"Venus Flytrap Name": "Bimbo", "Description": "Bimbo showcases excellent coloration, and grows into big traps.  The leaves and traps of Dionaea 'Bimbo' are among the largest of all Venus flytrap cultivars.  Traps are up to 5cm in length and are borne on leaf bases that may be 10cm in length or more.  In addition to its impressive size, Bimbo is also capable of attaining extremely dark red coloration on its trap interiors.  A beautiful cultivar, hands-down.                                Learn More"},
{"Venus Flytrap Name": "Clayton's Volcanic Red", "Description": "Clayton's Volcanic Red is a Venus fly trap clone originating from Colin Clayton of Australia that has deep red coloration.  It is an average-sized flytrap that also has the interesting characteristic of always producing bifurcating flower stalks.                                Learn More"},
{"Venus Flytrap Name": "Red Fused Petiole - BCP F04", "Description": "Red Fused Petiole shares the rare distinction with Korrigans and Crocodile of having unique leaf bases that fuse to the trap, interestingly eliminating the petiole from the plant, which is quite unusual!  Most impressively, Red Fused Petiole exhibits beautiful magenta coloration that can become so deeply saturated that it appears almost purple.  Best Carnivorous Plants, of Europe, chose this cultivar as exceptional- a great endorsement indeed.                                Learn More"},
{"Venus Flytrap Name": "Booman's Mutant", "Description": "Booman's Mutant is an awesome little chameleon.  The appearance of Booman's Mutant varies drastically from season to season.  It normally has long, thin leaf-bases, similar to Korean Melody Shark.  And in the spring traps look almost normal, but are slightly misshapen with shorter-than-normal teeth (cilia).  As the growing season progresses, the teeth get shorter and shorter and almost appear non-existent during the winter months, as shown in the product photo.                                Learn More"},
{"Venus Flytrap Name": "Vitiligo", "Description": "\"Vitiligo\" was developed back in 2005 by Trev Cox from a batch of ‘Dentate’ seed crosses. It was selected for its unusual interior trap coloration, which it displays in a pattern of unique patches. ‘Vitiligo’ also has short teeth (cilia) which have an appearance somewhere between a ‘Dentate’ and ‘Sawtooth’ Venus Flytrap.                                Learn More"},
{"Venus Flytrap Name": "WIP Long Snapper", "Description": "One of 4 plants in the WIP family of flytraps, selected by long-time carnivorous plant grower Bob Hanrahan, WIP Long Snapper grows exceptionally long and sturdy leaves and is a truly impressive plant.                                Learn More"},
{"Venus Flytrap Name": "SD Draco", "Description": "SD Draco is a beautifully colorful flytrap, that is capable of getting extremely red coloration all over the leaves and traps, though it is still considered a green-leafed flytrap.  It is a green-leafed flytrap that can chameleon into a red-leafed flytrap; how cool!  It will be the most colorful green-leafed flytrap in your collection!                                Learn More"},
{"Venus Flytrap Name": "FTS Big Behemoth", "Description": "FTS Big Behemoth is a nice, giant flytrap selected from our breeding stock here at FlytrapStore.  Unlike most giants, which produce their largest traps in the spring, FTS Big Behemoth tends to produce large traps all year long and is normally one of the flytraps in our collection with the largest traps as the plants enter dormancy.\r\n\r\nFTS Big Behemoth is has a typical growth habit with upright growth in the spring and summer and low-lying growth in late fall and winter.                                 Learn More"},
{"Venus Flytrap Name": "\"Holiday Traps\"", "Description": "New & Time-Limited FlytrapStore Exclusive - \"Holiday Traps\"     Two beautiful holiday-hued Venus Flytraps potted together, 1 red & 1 green.  A vibrant and colorful holiday pairing, sure to delight.\r\n\r\nA perfect and especially unique holiday gift, we are offering Holiday Traps for the first time this year, and only during the holidays.  You might just want to keep one for yourself!  \r\n\r\n*Please note:  Photo is a characteristic example only - plant(s') coloration, type, and size will vary somewhat due to natural plant variation.                                Learn More"},
{"Venus Flytrap Name": "Microdent x Weinrot", "Description": "Selected from a group of seedlings resulting from a Microdent and Weinrot (red-leafed flytrap) cross, this particular Venus flytrap has the ability to develop beautiful deep red traps and a red line on the outside of the trap in strong light.  Like the mother plant, Microdent, this particular clone also has exceptionally short and numerous teeth.                                Learn More"},
{"Venus Flytrap Name": "Scarlatine", "Description": "Scarlatine is a spotted sawtooth Venus flytrap, similar to Spotty but with stable variegation.  This plant was selected by and sourced from French Venus flytrap grower Lucien Blacher.  A very vigorous and large growing plant.  Beautiful, to say the least!                                Learn More"},
{"Venus Flytrap Name": "Crocodile", "Description": "Crocodile is named for its traps that resemble an open crocodile's mouth!  It very uniquely grows a leaf-base that is fused directly to the trap, and is missing a petiole.  Quite the freaky cultivar!   Also, Crocodile is an extremely vigorous and hardy plant, with its \"scary\" Croc traps.                                Learn More"},
{"Venus Flytrap Name": "Alien", "Description": "'Alien' is a Venus fly trap clone originating from Europe that has extremely elongated traps and unique looking teeth that give it the appearance of the terrifying alien from Ridley Scott's famous film.  Its traps can grow surprisingly large, and it is a very hardy cultivar.                                Learn More"},
{"Venus Flytrap Name": "FTS Towering Giant", "Description": "\"FTS Towering Giant\" is our newest release in the line of giant Venus flytraps we carry.  This elongated monster flytrap creates spring leaves that can reach over 7 inches in length!  Couple this with larger-than-average sized traps, and it's definitely an attention grabber...as well as an insect nabber!!!                                Learn More"},
{"Venus Flytrap Name": "Schuppenstiel 2", "Description": "Schuppenstiel 2 is another \"freaky\" flytrap with scaling on the leaf-base much like its relative Schuppenstiel 1.  \"Schuppenstiel\" means \"scary stalk\" in German and the thick, textured leaf-bases sure do make the plant look scarier!                                Learn More"},
{"Venus Flytrap Name": "African Werewolf", "Description": "\"African Werewolf\" is a new cultivar, released summer of 2022, originating from South Africa.  It is distinct from the Werewolf clone from Europe and is more reminiscent of 'Dracula' but is a GIANT flytrap with excellent vigor!  A truly awesome plant and we're excited to be the first grower in the US of this wonderful flytrap!!                                Learn More"},
{"Venus Flytrap Name": "Freaky Star", "Description": "\"Freaky Star\" was chosen for great distinction by Araflora in the Netherlands, because of its extremely uncommon and highly remarkable traps that are much different than a typical Venus Flytrap.  Freaky Star showcases razor-frayed trap margins, resembling an exploding star.  \r\n\r\n                                 Learn More"},
{"Venus Flytrap Name": "Big Mouth", "Description": "The Big Mouth Venus Flytrap is prized for its large traps, deep color and neat growth habit. Unlike most Venus Flytraps that grow taller and thinner during the summer and can look a little \"leggy\" and unkempt, Big Mouth's leaves grow prostrate in a neat rosette close to the ground year round.                                Learn More"},
{"Venus Flytrap Name": "Trichterfalle x Coquillage", "Description": "Trictherfalle x Coquillage is a superior plant selected from many seedling from this cross breeding done in 2012.  It exhibits unusually long \"teeth\" that rival or even surpass those of Phalanx, and extreme scaling, or cresting, on the leaves, similar to Schuppenstiel but even more pronounced at times.  Additionally, it regularly produced \"pitfall traps\" similar to the mother plant, Trichterfalle.  It can produce beautiful coloration, and is a hardy upright grower.                                Learn More"},
{"Venus Flytrap Name": "Holland Red", "Description": "Holland Red is an improved red-leafed Venus Flytrap and an officially registered cultivar.                                 Learn More"},
{"Venus Flytrap Name": "Jaws", "Description": "A favorite of everyone at FlytrapStore.com, Jaws is a vicious looking large-trapped Venus Flytrap, the result of a cross between Dentate Traps and a vigorous unnamed Flytrap.  In addition to the traps being extra-large, they are often a deep, bloody red, especially into the Summer.  Jaws is an attractive upright grower (when not Dormant).\r\n\r\nNote:  Interestingly, the saw-tooth development for Jaws is seasonal, showing up most strongly in the Summer.                                Learn More"},
{"Venus Flytrap Name": "Mirror", "Description": "Mirror is a highly-unusual Venus Flytrap clone that can intermittently produce a mirror-image-like trap on the back side of the spine of some of its traps, or sometimes one or two cup-like projections on either side. It is also quite hardy, and would be a great beginner plant for this reason.                                  Learn More"},
{"Venus Flytrap Name": "Trichterfalle", "Description": "Trichterfalle, also known as \"Funnel Trap,\" is a bizarre Venus Fly trap that grows traps which are fused together at the inner margins where the trap connects to the rest of the leaf. This fusing creates an interesting and odd looking trap like no other flytrap produces. Trichterfalle also occasionally has \"scaling\" on the leaves which gives them a rough, sand paper-like appearance at certain times of the year.                                Learn More"},
{"Venus Flytrap Name": "DC All Red", "Description": "DC All Red is one of the darkest of the red Venus Flytrap clones. The red color is developed most intensely in strong light.                                Learn More"},
{"Venus Flytrap Name": "Microdent", "Description": "Microdent is an officially registered Venus fly trap clone that has an extreme number of extremely small teeth, looking like an open dolphin's mouth!  It is also one of the hardiest growers we know of, and is a favorite here at FTS.                                Learn More"},
{"Venus Flytrap Name": "FTS Deep Red Guerrilla", "Description": "FTS Deep Red Guerrilla is a very colorful, beautiful, low-growing Venus flytrap that we grew from seed .  It boasts larger than average traps, shorter than average teeth, excellent vigor, and can display extraordinary red coloration.                                  Learn More"},
{"Venus Flytrap Name": "Korean Melody Shark", "Description": "Korean Melody Shark is a very unusual and rare Venus Flytrap. The petioles (the long part of the leaf that supports the trap) of Korean Melody Shark lack flanges, and therefore resemble jungle vines, sometimes curling around in squiggly shapes. The traps are uniquely shaped like music notes, and are colored a pleasing light tangerine color.  The cilia are even unique, with a jagged sawtooth-like pattern.  Overall, about as unique of a flytrap as you can find, and really out-of-this-world looking.                                Learn More"},
{"Venus Flytrap Name": "FTS Crimson Sawtooth", "Description": "FTS Crimson Sawtooth is a deep red plant with short, highly serrated marginal teeth, developed by the Flytrap Store breeding and tissue culture program, an improvement upon the older Red Piranha, with wider, more substantial leaves and a neater growth habit.                                Learn More"},
{"Venus Flytrap Name": "Fine Tooth x Red", "Description": "Fine Tooth x Red is one of the best Venus Flytraps. Other clones come and go and don't prove themselves over time. But Fine Tooth x Red continues to be one of the best standard Venus Flytrap clones one can grow, with vigor, color, and hardiness.                                Learn More"},
{"Venus Flytrap Name": "BCP B01 - Red Bull", "Description": "BCP B01 (or Red Bull) was selected for exceptional distinction by Best Carnivorous Plants because of its very unique and attractive placement of color on the trap interior - interesting and eye-catching mottled and spattered red coloration on the bottom of the trap, resembling the interior of a peach!  It also exhibits a very nice high-arching \"back,\" and we are impressed by its vigor and hardiness.  Guaranteed to be a stand-out in your collection.                                Learn More"},
{"Venus Flytrap Name": "Venus Fly Trap (\"Classic\")", "Description": "An unnamed \"classic\" Venus Flytrap. A healthy, well-grown Venus Flytrap at a bargain price.                                Learn More"},
{"Venus Flytrap Name": "Seed-Grown Venus Flytrap", "Description": "The vast majority of Venus Flytraps sold and distributed are clones. But seed-grown Venus Flytraps are each unique and display a wide variety of characteristics of growth, color and form. Great for adding diversity to a collection or breeding program.                                Learn More"},
{"Venus Flytrap Name": "El Gecko's Large Traps", "Description": "Grown from seed, named and distributed by carnivorous plant community member \"elgecko\" way back in 2004, this giant flytrap is capable of getting traps over 1.7 inches; definitely \"giant\" by any measure!                                Learn More"},
{"Venus Flytrap Name": "SL Seedling", "Description": "SL Seedling is a short-toothed Venus fly trap imported from Europe that exhibits excellent coloration and short teeth.  It is a seedling selected by famous Irish Venus flytrap enthusiast, Trev Cox.  The SL stands for Stefan Lessen, the person from who Trev obtained the plant as a seedling.                                Learn More"},
{"Venus Flytrap Name": "Angel Wings", "Description": "Angel Wings will make you do a double-take for sure! -  it's traps are turned inside out!!  Angel Wings is also beautifully and uniquely hued, with salmon pink washed over its overtly curved open traps, and trap lashes that curl about at random.  Not to mention that Angel Wings is exceptionally hardy.  Matt and Leah love this one, and hope you will too!                                Learn More"},
{"Venus Flytrap Name": "Wally", "Description": "If you like Big Mouth and Low Giant, you'll love Wally!  Wally is very similar in neat growth habit, with its year-round ground-hugging big traps, but can impressively develop even more exceptional and eye-catching bright red coloration on its trap interiors.  It reproduces more than most other Venus flytraps, producing baby Wally flytraps so you can have more Wallys!  Not to mention, it's one of the hardiest Venus Flytraps we know of.  Everything to like about this one - it has become one of our favorites since recently being able to acquire it.                                  Learn More"},
{"Venus Flytrap Name": "Megatraps", "Description": "The Megatraps Venus Flytrap (also called G17) is a clone with large traps that is able to obtain excellent seasonal coloration.  It is a handsome upright grower (when not Dormant).\r\n\r\nSeasonal note:  Megatraps develops its coloration variably, and more obviously during the active growing season as the summer progresses.  Fun to watch!                                Learn More"},
{"Venus Flytrap Name": "Schuppenstiel I", "Description": "Schuppenstiel I, which means \"scary stalk\" in German, is a Venus Flytrap with extreme scaling, or cresting, on the leaf-bases. The scaling gives the leaves a \"rough\" look similar to human skin when viewed up close! It can also develop bright red attractive coloration on trap interiors. Unique and scarily beautiful!                                Learn More"},
{"Venus Flytrap Name": "Louchapates", "Description": "Louchapates is an officially registered Venus fly trap clone that exhibits traps with fused distal ends, forming a cupped shaped trap, and fused teeth that fork at the ends.                                Learn More"},
{"Venus Flytrap Name": "G16", "Description": "Also known as \"Slack's Giant\", G16 is a giant Venus flytrap clone with excellent deep red coloration on the interior of the traps, and nice upright growth.  An absolute stunner of a plant!  Late in the year this flytrap always draws our eyes to it with the excellent coloration and extremely large traps.  One of our favorite flytraps here at the FlytrapStore, G16 is highly recommended for any flytrap collection!\r\n\r\nSeasonal note:  G16 develops its coloration variably, and more obviously during the active growing season as the summer progresses.  Fun to watch!                                Learn More"},
{"Venus Flytrap Name": "FTS Lunatic Fringe", "Description": "FTS Lunatic Fringe, a Flytrap Store exclusive Venus Flytrap. A FlytrapStore original clone raised from seed that was harvested in 2009, \"FTS Lunatic Fringe\" is easily recognizable by its uniquely highly serrated trap margins, which are even more serrated than those of Sawtooth or Bristletooth.   FTS Lunatic Fringe is capable of producing very large traps and is a very unique and attractive cultivar.                                Learn More"},
{"Venus Flytrap Name": "FTS Flaming Lips", "Description": "A FlytrapStore original clone raised from seed that was harvested in 2008, \"FTS Flaming Lips\" is one of the most colorful Venus fly traps we have ever laid eyes on. It grows large traps with short, sharp teeth (cilia). \"FTS Flaming Lips\" was named for its vibrant sunset-shades of color infused across the traps.                                Learn More"},
{"Venus Flytrap Name": "Coquillage", "Description": "'Coquillage' is the french word for \"shell\" and refers to the shape of the trap which resembles a seashell, especially when closed.  Nothing else can be mistaken for Coquillage, as it is extremely unique.  In addition to its unique beauty, Coquillage is also extraordinarily hardy and grows very well.                                Learn More"},
{"Venus Flytrap Name": "A2", "Description": "The \"A2\" is the impressive attractive sibling of the very popular 'B52' Venus flytrap variety, originally named \"A1\" by grower Henning von Schmeling, which is well-known for its extraordinarily large traps.  The traps of \"A2\" easily rival the 'B52' in size.  In coloring, the \"A2\" can develop brightly red-hued trap interiors, moreso than its 'B52' sibling.                                  Learn More"},
{"Venus Flytrap Name": "WIP Slim Snapper", "Description": "Wowza, this one can grow some big traps!  WIP Slim Snapper can produce some big ol' traps, that sit atop uniquely long slender leaves, making the traps appear even larger than they are.  WIP Slim Snapper was chosen as superior from among thousands of other Venus Fly Traps grown on Bob Hanrahan's \"WIP\" carnivorous plant plantation in Georgia, because of its impressive vigor and unique loooong leaves.  WIP Slim is a long and lanky cool drink of water.  Sip one up!  (Check out the photo below to the see the unique difference in WIP Slim Snapper's growth habit compared to low-growers).\r\n                                Learn More"},
{"Venus Flytrap Name": "FTS Maroon Monster", "Description": "FTS Maroon Monster, a Flytrap Store exclusive Venus Flytrap. Developed by the Flytrap Store breeding program, the FTS Maroon Monster is a superior red-leafed Venus Flytrap, with extra-large Traps, vigorous growth and deep red color. (See full description for details and comparison with other red-leafed Venus Flytraps.)                                Learn More"},
{"Venus Flytrap Name": "Wacky Traps", "Description": "It doesn't get much more unique than this one!  Venus Flytraps are already unique and rare, but Wacky Traps is truly an awesomely wacky Venus Flytrap, sporting jagged traps that goes this-way-and-that, never what you expect.  It is made of uniquely thick plant tissue, giving it a cactus-like feel,  and providing hardiness against the elements.  It can develop cool spotted red-toned coloration on the trap interiors.  Wacky Traps used to be almost impossible to get until Matt obtained it from overseas.  A collector's item for sure; quite a find.  It is a genetically smaller plant than the \"giant\" flytraps, instead putting its energy into its wackiness!                                Learn More"},
{"Venus Flytrap Name": "B52", "Description": "B52 is known as the famous \"World's Largest Traps\" Venus Flytrap.  Though it may be dethroned from this title by the newly released DC XL Venus Flytrap, it is nonetheless without question one of the most impressive Venus Flytraps that exist, developing huge wide traps, and often exhibiting striking bright red color on its trap interiors.  It is truly a superior Venus Flytrap, in a class of its own.                                Learn More"},
{"Venus Flytrap Name": "FTS Purple Ambush", "Description": "A stunning beauty of a flytrap, FTS Purple Ambush develops intensely reddish-purple interior traps.  Out of the thousands of flytraps, we grow here at the FlytrapStore, it has the deepest red-colored traps of any plant we've seen.                                  Learn More"},
{"Venus Flytrap Name": "Petite Dragon", "Description": "The Petite Dragon' is an officially registered Venus fly trap cultivar.  'Petite Dragon' that is red Venus Flytrap clone that looks much like 'Akai Ryu' (Red Dragon in Japanese), but is smaller with the largest traps only attaining 17mm long according to the official ICPS registration.  One other notable and interesting characteristic of 'Petite Dragon' is that the flower stalk on mature plants always bifurcates (splits into two stalks).                                Learn More"},
{"Venus Flytrap Name": "25 Baby Venus Flytraps for 25 Dollars", "Description": "25 baby Venus Flytraps, shipped bareroot (not potted), for a very reasonable 1 dollar per plant. These Venus Flytraps could be any seed-grown plant or clone(s), our choice (no special requests). A great bargain on baby Venus Flytraps.                                Learn More"},
{"Venus Flytrap Name": "Fused Tooth", "Description": "The Fused Tooth Venus Flytrap has marginal spines that are fused together in various and fascinating ways, giving it a very distinctive and otherworldly appearance.  It is definitely one of the most unique Venus Flytraps, and can also develop beautiful red coloration on the trap interiors.\r\n\r\n'Fused Tooth' is an officially registered Venus Flytrap cultivar. \r\n\r\nNote:  Interestingly, the fusing of the marginal spines of Fused Tooth is variable and seasonal, most fused in Summer and early Fall, least fused during late Fall, Winter and early Spring.                                Learn More"},
{"Venus Flytrap Name": "G14", "Description": "G14 produces large traps and attains deep red coloration on the interior of the traps in good lighting.  Additionally G14 often has bloody red teeth!  G14 is also known as \"Dirk Ventham's GIant\" and is an impressively vigorous Venus fly trap!                                Learn More"},
{"Venus Flytrap Name": "Pot of Baby Flytraps", "Description": "Several baby Venus Flytraps for you to love, cherish, raise to adulthood and be proud of, already potted and ready to grow vigorously with the love and care they deserve.                                Learn More"},
{"Venus Flytrap Name": "Mystery Box!", "Description": "Either 5 or 10, you choose below, small to medium-sized Venus Flytraps, pitcher plants (possibly quite large!), or other carnivorous plants at a rock-bottom bargain price.\r\n\r\nA Mystery box is a great deal but also a bit of a gamble! You might be happy with what you receive or you might be disappointed.  See full description below for details.\r\n\r\nIf you'd like a bit more assurance as to what you will be receiving, be sure to check out the Premium Mystery Box.                                Learn More"},
{"Venus Flytrap Name": "Red Piranha", "Description": "Red Piranha Venus Flytraps have short, jagged teeth and leaves and traps liberally splashed with red, often with contrasting lime-green trap margins.                                Learn More"},
{"Venus Flytrap Name": "Dentate Traps", "Description": "Dentate Traps is one of the hardiest Venus Flytraps we know of, which of course makes it a most excellent Flytrap choice for those beginning the hobby.  It is a very impressively sturdy upright grower, with unique and intimidating throwing-star-like \"teeth,\" and the ability to grow nice large traps.  We're pretty sure almost every collector has a Dentate Traps in their menagerie; it's a basic must-have Venus Flytrap, and a handsome one at that.\r\n                                Learn More"},
{"Venus Flytrap Name": "Pink Venus", "Description": "The Pink Venus Venus Flytrap has intensely deep-red traps and green leaves brushed liberally with the same color of red. A beautiful Venus Flytrap with dependable color!                                Learn More"},
{"Venus Flytrap Name": "Akai Ryu", "Description": "The Akai Ryu \"Red Dragon\" Venus Flytrap quite impressively exhibits striking and attractive dark-red coloration of the entire plant, including leaves and traps.  Akai Ryu can develop a gorgeous range of color, from purple-ish to maroon to lighter-red with green accents.  It is statuesque upright grower, showcasing elegant long slender leaves, and big traps.  Indeed, it is such an exquisite Venus Flytrap that it was chosen with high distinction as a breeding parent plant, by the famous Atlanta Botanical Gardens in Georgia.\r\n\r\n                                 Learn More"},
{"Venus Flytrap Name": "Long Red Fingers", "Description": "Long Red Fingers is a small but unusual and attractive Venus Flytrap clone. The spines on the traps of Long Red Fingers are not only long and often red, but frequently fused and crossed. Also, the traps are a cup shape, rather than the typical Venus Flytrap shape.  Very nice clone.                                Learn More"},
{"Venus Flytrap Name": "Bohemian Garnet", "Description": "Bohemian Garnet is distinct most notably for its striking deep red coloring and its unique saw-like teeth.  It is also unique for its red-leafed compact petite size, with mature plants typically only reaching 2 to 3 inches in diameter, bested only by Petite Dragon in this category.  It was first bred in the Czech Republic (Bohemia), and named after the beautiful gem, garnet.  The Bohemian Garnet multiplies more than average, with many baby flytraps.  This Venus Flytrap has the distinction of being an officially registered cultivar.                                Learn More"},
{"Venus Flytrap Name": "Scarlet Bristle", "Description": "'Scarlet Bristle' is a very nice short-tooth, red-leafed Venus flytrap variety.  In addition to its unique color and teeth, it also produces unusually thick and \"bristly\" trigger hairs.                                Learn More"},
{"Venus Flytrap Name": "Big Vigorous", "Description": "Big Vigorous is an unusually robust Venus Flytrap that in addition to a vigorous growth habit, produces large and often very colorful traps.                                Learn More"},
{"Venus Flytrap Name": "Vigorous", "Description": "The Vigorous Venus Flytrap lives up to its name, growing rapidly into dense rosettes, but it is also outstanding for the size of traps it can produce and the color it sometimes exhibits.                                Learn More"},
{"Venus Flytrap Name": "BZ \"1955\"", "Description": "BZ 1955 is a colorful, vigorous and historical Venus Flytrap, the very first Venus Flytrap bought by well-known United States carnivorous plant grower and expert Bob Ziemer in 1955 from the Woolworth Five and Dime store on Shattuck Avenue in Berkeley, California. This Venus Flytrap has been in continuous cultivation since 1955 and shared by division and more recently by tissue culture propagation.  The \"1955\" is like owning a piece of Venus flytrap history!                                Learn More"},
{"Venus Flytrap Name": "Sawtooth", "Description": "The Sawtooth, a striking and colorful Venus Flytrap cultivar, has rows of eye-catching highly-serrated saw-like \"teeth\" gracing the periphery of its traps. It grows sturdily upright with nice large traps, and develops beautiful red coloration on the interior of its traps.  Sawtooth also reproduces more easily than other flytraps, producing more baby flytraps than usual.  It is a very hardy and vigorous cultivar, great for a beginner, and a must-have for collectors.                                Learn More"},
{"Venus Flytrap Name": "Low Giant", "Description": "The Low Giant Venus Flytrap clone is a spectacular plant that produces  very large traps (rivaling even the B52) with broad leaves that grow prostrate (near the ground) year round in dense rosettes. It often develops a very deep red color in the traps.                                Learn More"},
{"Venus Flytrap Name": "BZ Razorback", "Description": "BZ Razorback, a colorful, ragged, short-toothed Venus Flytrap, was originally a plant produced from seed contributed to the Flytrap Store by longtime carnivorous plant grower Bob Ziemer and selected for propagation in the FlytrapStore tissue-culture lab.                                Learn More"},
{"Venus Flytrap Name": "Green Dragon", "Description": "The Green Dragon is a mutation of the Akai Ryu (Red Dragon) Venus Flytrap. Green Dragon is a very vigorous grower, unlike most red-leaved Venus Flytraps, and can produce remarkably large traps with very striking coloration.                                Learn More"},
{"Venus Flytrap Name": "Dutch Delight", "Description": "Voted the best commercial Venus Flytrap in the Netherlands in 2005, Dutch Delight matures into a large plant with big traps!  It can also develop delicate pink coloration on the trap interiors.                                Learn More"},
{"Venus Flytrap Name": "Royal Red", "Description": "Royal Red bears large traps on long and graceful petioles, deep dark red with strikingly contrasting lime-green borders on the traps.  It is an officially registered cultivar.                                 Learn More"},
{"Venus Flytrap Name": "Clayton's Red Sunset", "Description": "Clayton's Red Sunset is a dark red Venus Flytrap that grows slowly, often has relatively thin leaves  (petioles) and develops its best color in strong light.                                Learn More"},
{"Venus Flytrap Name": "Bristletooth", "Description": "As we walk through the greenhouse, it is Bristletooth that every time will catch our eye first.  With its extraordinary bright red trap interiors with a striking contrasting trap margin, and its many very short and irregular  \"teeth\" (the traps' marginal spines or cilia), it is a very striking Venus flytrap indeed.  It is also quite vigorous, producing many offspring.                                Learn More"},
{"Venus Flytrap Name": "Grun", "Description": "Grun is a very hardy (one of the absolute hardiest) all-green Venus Flytrap cultivar, that grows upright with large traps and uniquely vivid green coloration only.  Great Venus Flytrap for beginners.                                Learn More"},
{"Venus Flytrap Name": "Creeping Death", "Description": "The Creeping Death Venus Flytrap clone develops very long leaves terminated with above-average sized traps.                                Learn More"},
{"Venus Flytrap Name": "Spider", "Description": "Spider has extra-long leaf blades (the stems that the traps are attached to), so the leaves arch upward and then toward the ground like a spider's legs.                                Learn More"},
{"Venus Flytrap Name": "UK Sawtooth II", "Description": "The \"UK Sawtooth II\" is an awesomely colorful and bright Venus flytrap variety, with unique forked \"teeth\" similar to the well-known 'Sawtooth' Venus fly trap and 'Dentate Traps' varieties, with cilia that varies between those of these two varieties.  The bright-red coloring of the UK Sawtooth II trap interiors really stands out.  The UK Sawtooth II Venus Fly Trap is also a good parent plant, producing more natural divisions than many other types of Flytraps.                                Learn More"},
{"Venus Flytrap Name": "Polish Dracula", "Description": "\"Polish Dracula\" originates from an unknown grower in Poland.  \"Polish Dracula\" has short, pointy teeth that often develop a red coloration which are reminiscent of blood-stained vampire fangs!  It's an upright grower (when not Dormant), a beautiful vicious Flytrap!\r\n\r\nNote:  Interestingly, the saw-tooth development for Polish Dracula is seasonal, showing up most strongly in the Summer.                                Learn More"},
{"Venus Flytrap Name": "Red Shark Teeth - unacclimated clump", "Description": "Red Shark Teeth is one of the darkest red-colored plants in our collection.  It is a full-time low-growing Venus flytrap with short, thick teeth reminiscent of shark teeth, hence the name.  It is a wonderful plant and one of our recently acquired favorites!\r\nBEFORE ORDERING UNACCLIMATED PLANTS! -- Be sure to read our Terms & Conditions for unacclimated plants right out of tissue culture.                                Learn More"},
{"Venus Flytrap Name": "FTS Incredible Red Hulk - unacclimated clump", "Description": "FTS Incredible Red Hulk is a giant all-red Venus flytrap with a wide green stripe along the edge of its sawtoothed traps.  As the traps age, this green line gets narrower as the red color creeps outward.  FTS Incredible Red Hulk can get very large traps (over 1.5 inches) and extremely long petioles -- on the order of 8+ inches!  It is also very vigorous for a red-leafed flytrap and can retain large traps even into dormancy.  Truly an amazing plant!\r\nBEFORE ORDERING UNACCLIMATED PLANTS! -- Be sure to read our Terms & Conditions for unacclimated plants right out of tissue culture.                                Learn More"},
{"Venus Flytrap Name": "GJ Giant Shark - unacclimated clump", "Description": "GJ Giant Shark is a selection of a giant Venus flytrap with serrated teeth from Green Jaws Nursery in Germany.  It is quite similar in appearance to Jaws, a classic Venus flytrap that originated in the USA.\r\nBEFORE ORDERING UNACCLIMATED PLANTS! -- Be sure to read our Terms & Conditions for unacclimated plants right out of tissue culture.                                Learn More"},
{"Venus Flytrap Name": "GJ Giant Form - unacclimated clump", "Description": "GJ Giant Form is a selection of a giant Venus flytrap from Green Jaws Nursery in Germany. \r\n It has a largely typical growth pattern with upright growth during the spring and summer but can attain a very lage size!\r\nBEFORE ORDERING UNACCLIMATED PLANTS! -- Be sure to read our Terms & Conditions for unacclimated plants right out of tissue culture.                                Learn More"}
]