[
    {
        "EventName": "Guatemala: Our Culture is Our Resistance Gallery Exhibition & Lecture",
        "Date": "2023-04-11",
        "Time": "8:00 am",
        "Description": "Documentary photographer Jonathan Moller shares his powerful work. Show runs March 13-April 21.The college will host a reception on Friday, April 7, from 5-8pm. The artist will speak about the struggles of the Guatemalan people and his artistic process at 6 pm. All welcome, admission is free, light refreshments provided.  Qs: benjy.davies@pikespeak.edu Virtual Event Link: https://www.pikespeak.edu/academics/studio-west/art-gallery.php",
        "City": "Colorado Springs, CO",
        "Venue": "Downtown Campus, Studio West Gallery",
        "Tags": "Art,Educational"
    },
    {
        "EventName": "Masculine Places",
        "Date": "2023-04-11",
        "Time": "10:00 am",
        "Description": "Commonwheel's Masculine Places Gallery show includes Jon Sargent, Maria Battista, and Chris Alvarez. Each artist's work explores the theme in their own way and media. Jon Sargent's use of black and white photography featuring the male nude figure in natural settings defines his ideas of masculinity in our present time. \"May this exhibit give us a sense that masculine places are where men belong, find meaning in responsibilities, and are defined through their choices.\" Maria Battista's sculptures heighten the theme through bronze and alabaster. Public and private-commission sculptor Maria Battista births figures and portraits that are engaged in wonderment about the nature of reality. She is the owner-artisan of First Circle Studios, her space for the emergence of bronze, stone, and precious metal sculptures that celebrate the embodiment of spirit in the human being. Chris Alvarez's oil paintings show the viewer places that Chris identifies as masculine. Now a well-known figure drawing and painting teacher in the Pikes Peak region, Chris taught drawing at UCCS. After teaching a decade at the Cottonwood Center for the Arts, Chris opened the Alvarez Art School in 2010, where he teaches drawing and painting to adults and children.",
        "City": "Manitou Springs, CO",
        "Venue": "Commonwheel Artists Co-op",
        "Tags": "Art"
    },
    {
        "EventName": "The Colorado Springs Bridge Center",
        "Date": "2023-04-11",
        "Time": "12:30 pm",
        "Description": "Come learn about us, watch for awhile, have some fun with the new friends that you will meet! Leave with a sweet treat!",
        "City": "Colorado Springs, CO",
        "Venue": "The Colorado Springs Bridge Center",
        "Tags": "Food"
    },
    {
        "EventName": "City/County Drainage Board Meeting",
        "Date": "2023-04-11",
        "Time": "2:00 pm",
        "Description": "The City/County Drainage Board acts as an advisory board to City Council and the Board of County Commissioners regarding subdivision codes and regulations relating to the drainage and control of flood and surface waters and administration of the subdivision Storm Water Drainage Funds. View agendas and minutes In accord with the Americans with Disabilities Act of 1990 (\"ADA\"), the City of Colorado Springs will not discriminate against qualified individuals with disabilities. Should you require an auxiliary aid and/or service to participate in an upcoming meeting, please contact us as soon as possible but no later than 48 hours before the scheduled monthly meeting so that we can do our best to accommodate your needs.",
        "City": "Colorado Springs, CO",
        "Venue": "Pikes Peak Regional Building Department",
        "Tags": ""
    },
    {
        "EventName": "Basic Sign Language Workshop",
        "Date": "2023-04-11",
        "Time": "4:00 pm",
        "Description": "In a three basic hour workshop, participants will acquire enough knowledge to continue to independently learn sign language: All handshapes (letters and numbers); Basic phrases; Most importantly, rules of sign language This one session workshop will be repeated once per quarter (second Tuesday in January, April, July and October; 4-7 pm) at local adaptive recreation program for people with disabilities ARISE Beyond Barriers. $20. donation will fund socialization activities for people who have disabilities. In order to assure enough handout packets, snacks and water are available, please register in advance with ARISE Beyond Barriers.",
        "City": "Colorado Springs, CO",
        "Venue": "ARISE Beyond Barriers",
        "Tags": "Educational"
    },
    {
        "EventName": "Disabled American Veterans Chapter 26 Membership Meeting",
        "Date": "2023-04-11",
        "Time": "6:00 pm",
        "Description": "This is the monthly membership meeting for the Disabled American Veterans Chapter 26, Knob Hill for Colorado Springs, CO. Both Members and Guests are welcome! A hot meal is served at 6pm by our Auxiliary, and the meeting begins promptly at 7pm. We will discuss chapter matters, and assorted community outreach and committee activities.",
        "City": "Colorado Springs, CO",
        "Venue": "DAV 26 Knob Hill",
        "Tags": ""
    },
    {
        "EventName": "Folk Jam",
        "Date": "2023-04-11",
        "Time": "7:00 pm",
        "Description": "Folk Jam Beginners and professionals mix for a \"sing-along and play-along night' with traditional folk songs.",
        "City": "Colorado Springs, CO",
        "Venue": "Jives Coffee Lounge",
        "Tags": "Music"
    },
    {
        "EventName": "Geeks Who Drink Trivia Night at Hatch Cover",
        "Date": "2023-04-11",
        "Time": "7:00 pm",
        "Description": "NO REGISTRATION REQUIRED, JUST SHOW UP. Geeks Who Drink Trivia Night at Hatch Cover. Modeled after pub quizzes in Ireland and the U.K., Geeks Who Drink is an authentic homegrown trivia quiz. It’s a great way to drink with friends, without burning brain cells. And it’s where useless knowledge means everything. Our quizzes cover everything from Hungary to The Hunger Games, from science to sports, from the Billboard Hot 100 to Better Call Saul. Each quiz consists of seven rounds of eight questions each, in a variety of formats, including audio and visual rounds. Teams can be up to six players, so bring your smartest friends (or some likable dummies)—or come solo. We can always help you join a team! No reservations needed, just show up! Winning teams get bar cash and other prizes, depending on the venue. Bonus questions sprinkled throughout the quiz will net you additional goodies. But mostly it’s about establishing your dominance—or at least pleasantly surprising yourself. You’re into that, right?",
        "City": "Colorado Springs, CO",
        "Venue": "Hatch Cover",
        "Tags": "Drinking"
    },
    {
        "EventName": "Geeks Who Drink Trivia Night at Cleats Bar & Grill",
        "Date": "2023-04-11",
        "Time": "7:00 pm",
        "Description": "NO REGISTRATION REQUIRED, JUST SHOW UP. Geeks Who Drink Trivia Night at Cleats Bar & Grill. Modeled after pub quizzes in Ireland and the U.K., Geeks Who Drink is an authentic homegrown trivia quiz. It’s a great way to drink with friends, without burning brain cells. And it’s where useless knowledge means everything. Our quizzes cover everything from Hungary to The Hunger Games, from science to sports, from the Billboard Hot 100 to Better Call Saul. Each quiz consists of seven rounds of eight questions each, in a variety of formats, including audio and visual rounds. Teams can be up to six players, so bring your smartest friends (or some likable dummies)—or come solo. We can always help you join a team! No reservations needed, just show up! Winning teams get bar cash and other prizes, depending on the venue. Bonus questions sprinkled throughout the quiz will net you additional goodies. But mostly it’s about establishing your dominance—or at least pleasantly surprising yourself. You’re into that, right?",
        "City": "Colorado Springs, CO",
        "Venue": "Cleats Bar & Grill",
        "Tags": "Drinking"
    },
    {
        "EventName": "Volk",
        "Date": "2023-04-11",
        "Time": "7:00 pm",
        "Description": "",
        "City": "Colorado Springs, CO",
        "Venue": "Vultures",
        "Tags": "Music"
    },
    {
        "EventName": "Trivia",
        "Date": "2023-04-11",
        "Time": "7:00 pm",
        "Description": "3 rounds of trivia hosted by This is a Clue Trivia. Winning teams receive gift cards. Taco Tuesday specials too",
        "City": "Colorado Springs, CO",
        "Venue": "Good Company",
        "Tags": "Food"
    },
    {
        "EventName": "KaraSmokey Karaoke Club",
        "Date": "2023-04-11",
        "Time": "8:00 pm",
        "Description": "",
        "City": "Colorado Springs, CO",
        "Venue": "Speak Easy Vape Lounge and Cannabis Club",
        "Tags": "Drinking, Music"
    },
    {
        "EventName": "Guatemala: Our Culture is Our Resistance Gallery Exhibition & Lecture",
        "Date": "2023-04-12",
        "Time": "8:00 am",
        "Description": "Documentary photographer Jonathan Moller shares his powerful work. Show runs March 13-April 21.The college will host a reception on Friday, April 7, from 5-8pm. The artist will speak about the struggles of the Guatemalan people and his artistic process at 6 pm. All welcome, admission is free, light refreshments provided.  Qs: benjy.davies@pikespeak.edu Virtual Event Link: https://www.pikespeak.edu/academics/studio-west/art-gallery.php",
        "City": "Colorado Springs, CO",
        "Venue": "Downtown Campus, Studio West Gallery",
        "Tags": "Art, Educational"
    },
    {
        "EventName": "Cheyenne Mountain Newcomers Club",
        "Date": "2023-04-12",
        "Time": "9:30 am",
        "Description": "Cheyenne Mountain Newcomers Club is a social club for women of all ages and backgrounds residing in the Colorado Springs area. We are not religiously or politically affiliated. Our purpose is to welcome women new or long time residents of Colorado Springs. We have multiple activity groups ranging from but not limited to, reading clubs, hiking clubs, gourmet food and games. Find us on facebook at Cheyenne Mountain Newcomers Club or attend one of our monthly meetings. Annual member dues are $30/year. Two events can be attended before joining.",
        "City": "Colorado Springs, CO",
        "Venue": "Broadmoor Community Church",
        "Tags": ""
    },
    {
        "EventName": "Eiko Otake: I Invited Myself, Vol. II",
        "Date": "2023-04-12",
        "Time": "10:00 am",
        "Description": "Movement is fundamental to the artist Eiko Otake, who uses her body to explore themes of mortality, time, and place. Growing up in post-World War II Japan, Otake studied dance and performance in Europe before moving to New York in 1976. For more than four decades, she was part of Eiko & Koma, a collaborative that created performance, choreography, visual design, sound, videos, and texts. Since 2014, Otake has worked as a soloist and has directed her own projects in collaboration with other artists. Otake’s first museum solo-exhibition, I Invited Myself, Vol. II, foregrounds the artist’s video and media, which have developed alongside her dance, choreography, and performance installations. Spanning from 1980 to the present, the works on view feature a body as it moves in and through various spaces, including the urban infrastructure of Tokyo and New York and the vast landscapes of Wyoming and California.",
        "City": "Colorado Springs, CO",
        "Venue": "Colorado Springs Fine Arts Center at Colorado College",
        "Tags": "Art"
    },
    {
        "EventName": "Masculine Places",
        "Date": "2023-04-12",
        "Time": "10:00 am",
        "Description": "Commonwheel's Masculine Places Gallery show includes Jon Sargent, Maria Battista, and Chris Alvarez. Each artist's work explores the theme in their own way and media. Jon Sargent's use of black and white photography featuring the male nude figure in natural settings defines his ideas of masculinity in our present time. \"May this exhibit give us a sense that masculine places are where men belong, find meaning in responsibilities, and are defined through their choices.\" Maria Battista's sculptures heighten the theme through bronze and alabaster. Public and private-commission sculptor Maria Battista births figures and portraits that are engaged in wonderment about the nature of reality. She is the owner-artisan of First Circle Studios, her space for the emergence of bronze, stone, and precious metal sculptures that celebrate the embodiment of spirit in the human being. Chris Alvarez's oil paintings show the viewer places that Chris identifies as masculine. Now a well-known figure drawing and painting teacher in the Pikes Peak region, Chris taught drawing at UCCS. After teaching a decade at the Cottonwood Center for the Arts, Chris opened the Alvarez Art School in 2010, where he teaches drawing and painting to adults and children.",
        "City": "Manitou Springs, CO",
        "Venue": "Commonwheel Artists Co-op",
        "Tags": "Art"
    },
    {
        "EventName": "Contested Terrains",
        "Date": "2023-04-12",
        "Time": "10:00 am",
        "Description": "Landscape has been an important inspiration for artists across generations, and it played an important role in the foundation of this very institution. The soaring peaks of the Southern Rocky Mountains were a popular motif for many students and teachers of the Broadmoor Art Academy, founded in Colorado Springs in 1919, which evolved into the Fine Arts Center. Attracting renowned artists from across the country, mostly of European descent, the academy fostered a reverence for the natural landscape. But many depicted Colorado’s striking scenery as empty of human presence, ready to be explored for the benefit of the artist and viewer alike. Landscape remains important for contemporary artists, yet many have a dramatically different relationship to the genre. The five artists featured in Contested Terrains acknowledge how human intervention has shaped landscapes across the Americas. Joiri Minaya, for example, makes a connection between the Caribbean tourist economy and the arrival of the first European colonizers in Haiti. Nina Leo and Moez Surani present a view of the Great Lakes from Canada looking toward the US, offering a mournful homage to the unfifilled potential of a global superpower. Carolina Aranibar-Fernández looks at sites of extraction across the Americas. And Rosa Barba documents how transportation and development have altered a landscape in São Paulo, Brazil with shocking repercussions for the local community. Together, these artists extend the potential of landscape as a genre, and allow it to function as an entryway to overlooked histories, acknowledging how politics, power, and extraction have shaped the Americas as we know them today. Contested Terrains is organized by Katja Rivera, Curator of Contemporary Art. Support of the exhibition is generously provided by the Holaday Fund.",
        "City": "Colorado Springs, CO",
        "Venue": "Colorado Springs Fine Arts Center at Colorado College",
        "Tags": "Art,Educational"
    },
    {
        "EventName": "The Gift",
        "Date": "2023-04-12",
        "Time": "10:30 am",
        "Description": "“As scientists and artists, we are all observers of the world. We are all interpreters and storytellers,” said Dr. Gosnell. “We hope people leave this experience feeling a closer connection to the universe and with an understanding that the story of science belongs to all of us. We can build a more welcoming world from the stories we tell.” The Gift is an immersive installation that animates contemporary astrophysics research to open up metaphorical space for grief, care, and renewal. In this experience, participants enter a music-filled reading room, where they encounter an all-ages illustrated book—based on the astrophysics research of Dr. Natalie Gosnell, Assistant Professor of Physics at Colorado College—that invites responses both tactile and emotional. This book tells the story of two stars that are so close to one another yet so far from us that they appear as a single point of light in the sky. Their fates are intertwined; one star, at the end of its life, transfers its material to the companion, allowing the companion to burn brighter and to appear—for a moment—younger, brighter, bluer. This tender story and playful experience heeds the call of anthropologist Emily Martin, to “wake the sleeping metaphors of science.” The Gift is a collaborative project between Janani Balasubramanian, Dr. Natalie Gosnell, and Dr. Andrew Kircher. The book features artwork by Amy Myers and design by Katie Hodge. The original score is by Tina-Hanaé Miller with arrangement by Solomon Hoffman.",
        "City": "Colorado Springs, CO",
        "Venue": "Colorado Springs Fine Arts Center at Colorado College",
        "Tags": "Art,Music"
    },
    {
        "EventName": "Waters: sculptural work by Clay Enoch",
        "Date": "2023-04-12",
        "Time": "12:00 pm",
        "Description": "Surface gallery is honored to present Waters: sculptural work by Clay Enoch. Clay is a sculptor with known public and price work installed nationally. He has resided in Colorado Springs for many years, but has rarely shown in the Springs, so we are so excited for you to see his work. About the Exhibit: For many years, I have incorporated fused glass elements into my bronze figurative compositions. This show represents more exploration with bronze and terracotta into themes around water represented by resin and by kiln-cast glass. My work gravitates toward uplifting and inspirational themes, often ancient themes, leveraging the figure’s range to draw out transcendent truth and contemporary messages of hope and redemption. Within this context, my emphasis is on composition. Be it animals, skiers, or children, I am looking for the right posture, the most natural stance, the proper spacing, the perfect tension to make the work sculpturally compelling. I strive for conceptual consistency from the style and patina through to the presentation on the base. - Clay Enoch opening: APRIL 7th, 5-9 pm artist talk: Monday, April 17th, 5:30 pm exhibit on display through April 28th",
        "City": "Colorado Springs, CO",
        "Venue": "Surface Gallery",
        "Tags": "Art"
    },
    {
        "EventName": "Sarah Wright - Pathways, Energies, and Rhythms",
        "Date": "2023-04-12",
        "Time": "12:00 pm",
        "Description": "Sarah Wright - Pathways, Energies, and Rhythms Opening Friday, April 7th 5-9p.m. Exhibit Runs April 7-28th Artist Talk Thursday, April 20th 5:30 p.m.",
        "City": "Colorado Springs, CO",
        "Venue": "G44 Gallery",
        "Tags": "Art"
    },
    {
        "EventName": "Kristy Kensinger - Held by the Sun",
        "Date": "2023-04-12",
        "Time": "12:00 pm",
        "Description": "",
        "City": "Colorado Springs, CO",
        "Venue": "G44 Gallery",
        "Tags": "Art"
    },
    {
        "EventName": "The Colorado Springs Bridge Center",
        "Date": "2023-04-12",
        "Time": "12:30 pm",
        "Description": "Come learn about us, watch for awhile, have some fun with the new friends that you will meet! Leave with a sweet treat!",
        "City": "Colorado Springs, CO",
        "Venue": "The Colorado Springs Bridge Center",
        "Tags": "Food"
    },
    {
        "EventName": "Wolfgang",
        "Date": "2023-04-12",
        "Time": "4:30 pm",
        "Description": "",
        "City": "Colorado Springs, CO",
        "Venue": "",
        "Tags": "Music"
    }
]